#+title: Evaluaci칩n de la exposici칩n
#+author: Gunnar Wolf

* Aritm칠tica Binaria

- Tema presentado por :: Gerardo Torres
- Calificaci칩n global :: Por favor revisen m치s adelante para ver de
  d칩nde vienen todos estos n칰meros 游땔

|------------------------+------+--------------------+------+---------|
| Evaluaci칩n  compa침eros | Peso | Evaluaci칩n docente | Peso | *Total* |
|------------------------+------+--------------------+------+---------|
|                   8.64 |  0.3 |               8.63 |  0.7 |    8.63 |
|------------------------+------+--------------------+------+---------|
#+TBLFM: @2$5=$1*$2+$3*$4;f-2

* Comentarios

Dado que es una presentaci칩n en video, no puedo evaluar /dominio del tema/ y
/presencia/ como lo har칤amos habitualmente. Me centro en las respuestas que
hagan a las preguntas de sus compa침eros para el primero y en si la presentaci칩n
"suena" le칤da directamente del material que prepararon o expuesta m치s libremente
para el segundo.


* Evaluaci칩n grupal

|              | 1 | 2 | 3 | 4 | 5 | Total |
|--------------+---+---+---+---+---+-------|
| Originalidad | 0 | 0 | 1 | 6 | 3 |   8.4 |
| Nivel        | 0 | 0 | 0 | 5 | 5 |    9. |
| Relevancia   | 0 | 0 | 2 | 5 | 3 |   8.2 |
| Claridad     | 0 | 0 | 1 | 4 | 5 |   8.8 |
| Presencia    | 0 | 0 | 0 | 6 | 4 |   8.8 |
|--------------+---+---+---+---+---+-------|
|              |   |   |   |   |   |  8.64 |
#+TBLFM: @2$7..@6$7=10 * (0.2*$2 + 0.4*$3 + 0.6*$4 + 0.8*$5 + $6 ) / vsum($2..$6); f-2::@7$7=vmean(@2$7..@6$7); f-2

** Comentarios de los compa침eros

Tu exposici칩n recibi칩 los siguientes comentarios anonimizados por
parte de tus compa침eros:

- El video es muy largo, teniendo en cuenta la idea principal que se quiere
  comunicar al principio
- Me gustar칤a un poco m치s de participaci칩n
- Es un tema que durante la carrera se ha estudiado m치s de una vez. Sin embargo,
  repasarlo fue algo positivo. Quiz치s me falt칩 incluir una explicaci칩n de c칩mo
  se relaciona con los Sistemas Operativos. La explicaci칩n fue clara y fluida, y
  pude percibir el dominio del tema por parte de Gerardo.
- Buena Expo en general
- Es un tema relevante para la materia, anqu칠 creo que es m치s importante para la
  materia anterior a S.O, pues la mayor칤a de lo presentado en la exposici칩n lo
  aprend칤 en Estructura y programaci칩n de computadoras.
- Es informaci칩n muy completa y los ejemplos ayudan a entender mejor, pero
  tambi칠n esto hace que se haga demasiado extensa.
- En algunos partes de la exposici칩n podr칤a omitir algunos ejemplos o
  explicarlos de manera m치s general, como en la suma y resta de binarios, ya que
  pienso que no era tan necesario explicar cada caso (si bien, te ayuda a
  entender mejor, aumenta mucho la duraci칩n del video).

* Evaluaci칩n por parte del docente

| *Aspecto*              | *Peso* | *Evaluaci칩n* | *Puntos* |
|------------------------+--------+--------------+----------|
| Originalidad del tema  |    0.1 |           10 |       1. |
| Material desarrollado  |    0.2 |          7.5 |      1.5 |
| Contenido              |    0.2 |          7.5 |      1.5 |
| Fuentes bibliogr치ficas |    0.1 |           10 |       1. |
| Uso del tiempo         |    0.1 |           10 |       1. |
| Dominio del tema       |   0.15 |           10 |      1.5 |
| Presencia              |   0.15 |          7.5 |    1.125 |
|------------------------+--------+--------------+----------|
| *Global*               |        |              |     8.63 |
#+TBLFM: @<<$4..@>>$4=$2*$3::$4=vsum(@<<..@>>);f-2

** Comentarios
- Elegiste un tema complicado. Explicaste muy bien la /representaci칩n/ de los
  valores num칠ricos en base 2, pero la exposici칩n no aborda /mucho/ de lo bonito
  de la aritm칠tica: multiplicaciones y divisiones.
  - La suma est치 bien explicada, pero a la resta le falt칩 claridad. Aplaudo el
    esfuerzo que le dedicaste, que resulta claro, pero tu explicaci칩n sobre la
    resta resulta incompleta y m치s bien dif칤cil de seguir 游뗴
  - Comenzaste a explicar la representaci칩n de n칰meros fraccionales, pero no lo
    desarrollaste m치s. Parec칤a que ibas a meterte de lleno a explicar el formato
    de punto flotante, IEEE754:

        https://es.wikipedia.org/wiki/IEEE_754

    Aunque sin duda reconozco que ser칤a meter demasiada complejidad.


* Verificaci칩n de originalidad

Los reportes que env칤an son verificados utilizando la herramienta
/Compilatio/. Para fines de esta materia, el resultado de esta
revisi칩n /no tendr치 ning칰n efecto/ mientras el umbral de textos
copiados de otros documentos sin atribuci칩n sea menor al 30%.

- 17% de textos sospechosos
  - 2% de similitudes con otros documentos
  - 13% estil칤sticamente pr칩ximos a lo generado por IA (indicador, no
    prueba)
  - 2% idiomas no reconocidos
  - <1% de citas atribu칤das (citas expresas)
